<h1>Problen Set 02</h1>
    <li>BDTA1004-Data Programming</li>
    <li>Neev Parmar</li>
    <li>200474591</li>

<h1>Question:1</h1>
    Question-1 : 
   What value is displayed when the last expression (a) is evaluated? Explain your answer by indicating what happens in every executed statement.

In [4]:
a = 0

def b():
    
    global a
    a = c(a)
    
def c(a):
    return a + 2

In [5]:
b()

In [6]:
b()

In [7]:
b()

In [8]:
a

6

Initial value is 0 but after each b() run it adds 2 to the main value so after 3 itteration when we run the a it gives 6 as answer as the main value.

<p>######################################################################
</p>

<h1>Question:2</h1>
    Question-2 : 
   Function fileLength(), given to you, takes the name of a file as input and returns the length of the file:

In [35]:
file1 = open('myfile1.txt', 'w')
L = ["This is Delhi \n", "This is Ahmedabad \n", "This is Mimbai \n"]
s = "Hello\n"

file1.write(s)

file1.writelines(L)
  
file1.close()

file1 = open('myfile.txt', 'r')
print(file1.read())
file1.close()

In [33]:
import os

def fileLength(filename):
        try:
            data=f.readlines()
               line=""
                for i in data:
                        line+=i
                result=len(line)
                return result
        except FileNotFoundError:
                return ("File {} not found.".format(filename))

In [37]:
f=open('myfile1.txt','r')
print(fileLength('myfile1.txt'))
print(fileLength('myfile2.txt'))

56
0

<p>######################################################################</p>

<h1>Question:3</h1>
    Question-3 : 
    Now write a class named Kangaroo as a subclass of Marsupial that inherits all the attributes of Marsupial and also:

In [70]:
class marsupial:
    def __init__(self,a,b):
        self.pouch=[]
    
    def put_in_pouch(self,items):
        self.pouch.append(items)
        
    def pouch_contents(self):
        return self.pouch
    
class kangaroo(marsupial):
    def __init__(self,a,b):
        super().__init__(a,b)
        self.da = 0
        self.db = 0
        
    def jump(self,a,b):
        self.da = self.da + a
        self.db = self.db + b
        
    def __str__(self):
        
        return('I am a kaangaroo located at the given cordinates({},{})'.format(self.da,self.db))

In [71]:
k = kangaroo(0,0)
print(k)

I am a kaangaroo located at the given cordinates(0,0)

In [72]:
k.put_in_pouch('doll')

k.put_in_pouch('firetruck')

k.put_in_pouch('kitten')

print(k.pouch_contents())

['doll', 'firetruck', 'kitten']

In [73]:
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a kaangaroo located at the given cordinates(3,0)

<p>######################################################################</p>

<h1>Question:4</h1>
    Quetion-4 : 
    Write function collatz() that takes a positive integer x as input and prints the Collatz sequence starting at x. A Collatz sequence is obtained by repeatedly applying this rule to the previous number x in the sequence:

In [75]:
def printCollatz(n):
    
    while n != 1:
    print(n, end = ' ')

    if n & 1:
        n = 3 * n + 1

    else:
        n = n // 2

    print(n)

printCollatz(1)
printCollatz(10)

1
10 5 16 8 4 2 1

<p>######################################################################</p>

<h1>Question:5</h1>
    Question-5 : 
   Write a recursive method binary() that takes a non-negative integer n and prints the binary representation of integer n.

In [102]:
def find( decimal_number ):
    if decimal_number == 0:
        return 0
    else:
        return (decimal_number % 2 + 10 *
                find(int(decimal_number // 2)))
 
# Driver Code
decimal_number = 0
print(find(decimal_number))

decimal_number = 1
print(find(decimal_number))

decimal_number = 3
print(find(decimal_number))

decimal_number = 9
print(find(decimal_number))

0
1
11
1001

<p>######################################################################</p>

<h1>Question:6</h1>
    Question-6 : 
   Implement a class named HeadingParser that can be used to parse an HTML document, and retrieve and print all the headings in the document. You should implement your class as a subclass of HTMLParser, defined in Standard Library module html.parser. When fed a string containing HTML code, your class should print the headings, one per line and in the order in which they appear in the document. Each heading should be indented as follows: an h1 heading should have indentation 0, and h2 heading should have indentation 1, etc. Test your implementation using w3c.html.

In [202]:
from html.parser import HTMLParser


class HeadingParser(HTMLParser):
    headers = ['h1', 'h2', 'h3', 'h4', 'h5', 'h6']

    
    def handle_starttag(self, tag, attrs):
        if tag in self.headers:
            print(tag)

    def handle_endtag(self, tag):
        if tag in self.headers:
            print(tag)

    def handle_data(self, data):
        print(data)

In [203]:
infile = open('w3c.html')

In [204]:
content = infile.read()

In [205]:
infile.close()

In [206]:
hp = HeadingParser()

In [207]:
hp.feed(content)

W3C Mission Principles

<p>######################################################################</p>

<h1>Question:8</h1>
    Question-8 : 
   Write SQL queries on the below database table that return:

In [7]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\neevp\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: prettytable<1 in c:\users\neevp\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: sqlparse in c:\users\neevp\anaconda3\lib\site-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\neevp\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\neevp\anaconda3\lib\site-packages (from ipython-sql) (1.4.7)
Requirement already satisfied: six in c:\users\neevp\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: ipython>=1.0 in c:\users\neevp\anaconda3\lib\site-packages (from ipython-sql) (7.22.0)
Requirement already satisfied: setuptools>=18.5 in c:\users\neevp\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (52.0.0.post20210125)
Requirement already satisfied: jedi>=0.16 in c:\users\neevp\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.2)
Requirement already satisfied: pickleshare in c:\users\neevp\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in c:\users\neevp\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: pygments in c:\users\neevp\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.8.1)
Requirement already satisfied: traitlets>=4.2 in c:\users\neevp\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: decorator in c:\users\neevp\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.6)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\neevp\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.17)
Requirement already satisfied: colorama in c:\users\neevp\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\neevp\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\neevp\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\neevp\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.0.0)

In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%sql sqlite://

In [10]:
%%sql
CREATE TABLE whether
(
city varchar(15),
countrt varchar(15),
season varchar(15),
temperature float,
rainfall float
)

 * sqlite://
(sqlite3.OperationalError) table whether already exists
[SQL: CREATE TABLE whether (
city varchar(15),
countrt varchar(15),
season varchar(15),
temperature float,
rainfall float
)]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [13]:
%%sql
INSERT INTO whether VALUES('Mumbai', 'India', 'Winter', 24.8,5.9),
INSERT INTO whether VALUES('Mumbai', 'India', 'Spring', 28.4,16.2),
INSERT INTO whether VALUES('Mumbai', 'India', 'Summer', 27.9,1549.4),
INSERT INTO whether VALUES('Mumbai', 'India', 'Fall', 27.6,346.0),
INSERT INTO whether VALUES('London', 'United kingdom', 'Winter', 4.2,207.7),
INSERT INTO whether VALUES('London', 'United kingdom', 'Spring', 8.3,169.6),
INSERT INTO whether VALUES('London', 'United kingdom','Summer', 15.7,157.0),
INSERT INTO whether VALUES('London', 'United kingdom','Fall', 10.4,218.5),
INSERT INTO whether VALUES('Cairo', 'Egypt','Winter', 13.6,16.5),
INSERT INTO whether VALUES('Cairo', 'Egypt', 'Spring', 20.7,6.5)

 * sqlite://
(sqlite3.OperationalError) near "INSERT": syntax error
[SQL: INSERT INTO whether VALUES('Mumbai', 'India', 'Winter', 24.8,5.9),
INSERT INTO whether VALUES('Mumbai', 'India', 'Spring', 28.4,16.2),
INSERT INTO whether VALUES('Mumbai', 'India', 'Summer', 27.9,1549.4),
INSERT INTO whether VALUES('Mumbai', 'India', 'Fall', 27.6,346.0),
INSERT INTO whether VALUES('London', 'United kingdom', 'Winter', 4.2,207.7),
INSERT INTO whether VALUES('London', 'United kingdom', 'Spring', 8.3,169.6),
INSERT INTO whether VALUES('London', 'United kingdom','Summer', 15.7,157.0),
INSERT INTO whether VALUES('London', 'United kingdom','Fall', 10.4,218.5),
INSERT INTO whether VALUES('Cairo', 'Egypt','Winter', 13.6,16.5),
INSERT INTO whether VALUES('Cairo', 'Egypt', 'Spring', 20.7,6.5)]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [14]:
%%sql
select * from whether;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5)]

<li>a</li>
All the temperature data.

In [18]:
%%sql
select temperature from whether;

 * sqlite://
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,)]

<li>b</li>
All the cities, but without repetition.

In [19]:
%%sql
select distinct city from whether;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

<li>c</li>
All the records for India.

In [21]:
%%sql
select * from whether where countrt =='India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

<li>d</li>
All the Fall records.

In [22]:
%%sql
select * from whether where season == 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United kingdom', 'Fall', 10.4, 218.5),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United kingdom', 'Fall', 10.4, 218.5)]

<li>e</li>
The city, country, and season for which the average rainfall is between 200 and 400 millimeters.

In [23]:
%%sql
select city, countrt, season from whether where rainfall between 200 and 400

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United kingdom', 'Winter'),
 ('London', 'United kingdom', 'Fall'),
 ('Mumbai', 'India', 'Fall'),
 ('London', 'United kingdom', 'Winter'),
 ('London', 'United kingdom', 'Fall')]

<li>f</li>
The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.

In [25]:
%%sql
select city, countrt from whether where season == 'Fall' and temperature > 20 order by temperature ASC;

 * sqlite://
Done.

[('Mumbai', 'India'), ('Mumbai', 'India')]

<li>g</li>
The total annual rainfall for Cairo.

In [26]:
%%sql
select sum(rainfall) AS annual_rainfall from whether where city == 'Cairo';

 * sqlite://
Done.

[(46.0,)]

<li>h</li>
The total rainfall for each season.

In [27]:
%%sql
select season, sum(rainfall) AS annual_rainfall from whether group by season;

 * sqlite://
Done.

[('Fall', 1129.0),
 ('Spring', 384.59999999999997),
 ('Summer', 3412.8),
 ('Winter', 460.2)]

<p>######################################################################</p>

<h1>Question:9</h1>
    Question-9 : 
   . Suppose list words is defined as follows:
>>> words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
Write list comprehension expressions that use list words and generate the following lists:

In [5]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']


a = []
for u in words:
    a.append(u.upper())
print('value of a = {}'.format(a))


b = []
for v in words:
    b.append(v.lower())
print('value of b = {}'.format(b))


c = []
for w in words:
    c.append(len(w))
print('value of c = {}'.format(c))


d = []
for x in words:
    addition = []
    addition.append(x.upper())
    addition.append(x.lower())
    addition.append(len(x))
    d.append(addition)
print('value of d = {}'.format(d))


e = []
for y in words:
    if len(y) > 3:
        e.append(m)
print('value of e = {}'.format(e))

value of a = ['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']
value of b = ['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
value of c = [3, 5, 5, 3, 5, 4, 3, 4, 3]
value of d = [['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]
value of e = ['dog', 'dog', 'dog', 'dog', 'dog']

<p>######################################################################</p>